# Import Data and Libraries¶

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Project folder path
path = r'C:\Users\BhuwanDhakal\Sunita\Projects\2 Data Immersion\Advanced analytics $ Dashboard Desigh\Online Shopping Analysis'

In [3]:
path

'C:\\Users\\BhuwanDhakal\\Sunita\\Projects\\2 Data Immersion\\Advanced analytics $ Dashboard Desigh\\Online Shopping Analysis'

In [4]:
# Importing Online Shopping Dataframe 
df = pd.read_excel(os.path.join(path, 'Data', 'Original Data', 'file.xlsx'))

In [5]:
# Checking the Dataframe
df.head()

,Unnamed: 0,CustomerID,Gender,Location,Tenure_Months,Transaction_ID,Transaction_Date,Product_SKU,Product_Description,Product_Category,...,Avg_Price,Delivery_Charges,Coupon_Status,GST,Date,Offline_Spend,Online_Spend,Month,Coupon_Code,Discount_pct
0,0,17850.0,M,Chicago,12.0,16679.0,2019-01-01,GGOENEBJ079499,Nest Learning Thermostat 3rd Gen-USA - Stainle...,Nest-USA,...,153.71,6.5,Used,0.1,1/1/2019,4500.0,2424.5,1,ELEC10,10.0
1,1,17850.0,M,Chicago,12.0,16680.0,2019-01-01,GGOENEBJ079499,Nest Learning Thermostat 3rd Gen-USA - Stainle...,Nest-USA,...,153.71,6.5,Used,0.1,1/1/2019,4500.0,2424.5,1,ELEC10,10.0
2,2,17850.0,M,Chicago,12.0,16696.0,2019-01-01,GGOENEBQ078999,Nest Cam Outdoor Security Camera - USA,Nest-USA,...,122.77,6.5,Not Used,0.1,1/1/2019,4500.0,2424.5,1,ELEC10,10.0
3,3,17850.0,M,Chicago,12.0,16699.0,2019-01-01,GGOENEBQ079099,Nest Protect Smoke + CO White Battery Alarm-USA,Nest-USA,...,81.50,6.5,Clicked,0.1,1/1/2019,4500.0,2424.5,1,ELEC10,10.0
4,4,17850.0,M,Chicago,12.0,16700.0,2019-01-01,GGOENEBJ079499,Nest Learning Thermostat 3rd Gen-USA - Stainle...,Nest-USA,...,153.71,6.5,Clicked,0.1,1/1/2019,4500.0,2424.5,1,ELEC10,10.0

In [6]:
 df.describe()

,Unnamed: 0,CustomerID,Tenure_Months,Transaction_ID,Quantity,Avg_Price,Delivery_Charges,GST,Offline_Spend,Online_Spend,Month,Discount_pct
count,52955.000000,52924.00000,52924.000000,52924.000000,52924.000000,52924.000000,52924.000000,52924.000000,52924.000000,52924.000000,52955.000000,52555.000000
mean,26477.000000,15346.70981,26.127995,32409.825675,4.497638,52.237646,10.517630,0.137462,2830.914141,1893.109119,6.652800,19.953382
std,15286.936089,1766.55602,13.478285,8648.668977,20.104711,64.006882,19.475613,0.045825,936.154247,807.014092,3.333664,8.127108
min,0.000000,12346.00000,2.000000,16679.000000,1.000000,0.390000,0.000000,0.050000,500.000000,320.250000,1.000000,10.000000
25%,13238.500000,13869.00000,15.000000,25384.000000,1.000000,5.700000,6.000000,0.100000,2500.000000,1252.630000,4.000000,10.000000
50%,26477.000000,15311.00000,27.000000,32625.500000,1.000000,16.990000,6.000000,0.180000,3000.000000,1837.870000,7.000000,20.000000
75%,39715.500000,16996.25000,37.000000,39126.250000,2.000000,102.130000,6.500000,0.180000,3500.000000,2425.350000,9.000000,30.000000
max,52954.000000,18283.00000,50.000000,48497.000000,900.000000,355.740000,521.360000,0.180000,5000.000000,4556.930000,12.000000,30.000000

In [7]:
# Checking for  Statistics
dfd= df.describe()

In [8]:
dfdd =df.describe(include='all')

C:\Users\BhuwanDhakal\AppData\Local\Temp\ipykernel_14944\1239617456.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  dfdd =df.describe(include='all')

In [9]:
dfdd.to_clipboard()

In [10]:
# Checking the number of rows and columns before clean up
df.shape

(52955, 21)

# Wrangling datas

## Renaming and Dropping columns

In [11]:
# Dropping Column Index
df1 = df.drop(columns = 'Unnamed: 0')

In [12]:
# Renaming column Product_SKU to Product_ID

df1.rename(columns={'Product_SKU' : 'Product_ID'}, inplace = True)

In [13]:
# Renaming column GST to TAX

df1.rename(columns={'GST' : 'TAX'}, inplace = True)

In [14]:
# Finding the missing values of the Dataframe
df1.isnull().sum()

CustomerID              31
Gender                  31
Location                31
Tenure_Months           31
Transaction_ID          31
Transaction_Date        31
Product_ID              31
Product_Description     31
Product_Category         0
Quantity                31
Avg_Price               31
Delivery_Charges        31
Coupon_Status           31
TAX                     31
Date                    31
Offline_Spend           31
Online_Spend            31
Month                    0
Coupon_Code            400
Discount_pct           400
dtype: int64

#### The output shows there are missing values in 31 rows of multiple columns. so dropping those all 31 rows and imputing Coupon code equals 0 and Discount-pct equals NA.

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52955 entries, 0 to 52954
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   CustomerID           52924 non-null  float64
 1   Gender               52924 non-null  object
 2   Location             52924 non-null  object
 3   Tenure_Months        52924 non-null  float64
 4   Transaction_ID       52924 non-null  float64
 5   Transaction_Date     52924 non-null  datetime64[ns]
 6   Product_ID           52924 non-null  object
 7   Product_Description  52924 non-null  object
 8   Product_Category     52955 non-null  object
 9   Quantity             52924 non-null  float64
 10  Avg_Price            52924 non-null  float64
 11  Delivery_Charges     52924 non-null  float64
 12  Coupon_Status        52924 non-null  object
 13  TAX                  52924 non-null  float64
 14  Date                 52924 non-null  object
 15  Offline_Spend        52924 non-null  float64
 16  Online_Spend         52924 non-null  float64
 17  Month                52955 non-null  int64
 18  Coupon_Code          52555 non-null  object
 19  Discount_pct         52555 non-null  float64
dtypes: datetime64[ns](1), float64(10), int64(1), object(8)
memory usage: 8.1+ MB

In [16]:
 df1['Coupon_Code'].fillna("NA", inplace=True)

In [17]:
df1['Discount_pct'].fillna(0, inplace=True)

In [18]:
df1.isnull().sum()

CustomerID             31
Gender                 31
Location               31
Tenure_Months          31
Transaction_ID         31
Transaction_Date       31
Product_ID             31
Product_Description    31
Product_Category        0
Quantity               31
Avg_Price              31
Delivery_Charges       31
Coupon_Status          31
TAX                    31
Date                   31
Offline_Spend          31
Online_Spend           31
Month                   0
Coupon_Code             0
Discount_pct            0
dtype: int64

In [19]:
df1 = df1.dropna(axis=0)

In [20]:
df1.shape

(52924, 20)

In [21]:
# Checking the data type of df1
df1.dtypes

CustomerID                    float64
Gender                         object
Location                       object
Tenure_Months                 float64
Transaction_ID                float64
Transaction_Date       datetime64[ns]
Product_ID                     object
Product_Description            object
Product_Category               object
Quantity                      float64
Avg_Price                     float64
Delivery_Charges              float64
Coupon_Status                  object
TAX                           float64
Date                           object
Offline_Spend                 float64
Online_Spend                  float64
Month                           int64
Coupon_Code                    object
Discount_pct                  float64
dtype: object

In [22]:
# Changing data type of CustomerID, Transaction_ID, Month in df1
df1[['CustomerID', 'Transaction_ID', 'Month']] = df1[['CustomerID', 'Transaction_ID', 'Month']].astype(str)

In [23]:
# Changing data type of Date in df1

df1['Date'] = pd.to_datetime(df['Date'])

In [24]:
# Check for the mixed data types
for col in df1.columns.tolist():
  weird = (df1[[col]].applymap(type) != df1[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df1[weird]) > 0:
    print ("Column " + col + " has mixed data type")
else:
    print ("No columns with mixed datatype")

No columns with mixed datatype

## Finding Duplicates¶

In [25]:
df1_dups = df1[df1.duplicated()]

In [26]:
df1_dups

Empty DataFrame
Columns: [CustomerID, Gender, Location, Tenure_Months, Transaction_ID, Transaction_Date, Product_ID, Product_Description, Product_Category, Quantity, Avg_Price, Delivery_Charges, Coupon_Status, TAX, Date, Offline_Spend, Online_Spend, Month, Coupon_Code, Discount_pct]
Index: []

#### There is no Duplicates values in Dataframe

In [27]:
# Export dataframe to Cleaned_ Data
df1.to_excel(os.path.join(path, 'Data','Prepared Data', 'Cleaned_Data.xlsx'), index = False)

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52924 entries, 0 to 52923
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   CustomerID           52924 non-null  object
 1   Gender               52924 non-null  object
 2   Location             52924 non-null  object
 3   Tenure_Months        52924 non-null  float64
 4   Transaction_ID       52924 non-null  object
 5   Transaction_Date     52924 non-null  datetime64[ns]
 6   Product_ID           52924 non-null  object
 7   Product_Description  52924 non-null  object
 8   Product_Category     52924 non-null  object
 9   Quantity             52924 non-null  float64
 10  Avg_Price            52924 non-null  float64
 11  Delivery_Charges     52924 non-null  float64
 12  Coupon_Status        52924 non-null  object
 13  TAX                  52924 non-null  float64
 14  Date                 52924 non-null  datetime64[ns]
 15  Offline_Spend        52924 non-null  float64
 16  Online_Spend         52924 non-null  float64
 17  Month                52924 non-null  object
 18  Coupon_Code          52924 non-null  object
 19  Discount_pct         52924 non-null  float64
dtypes: datetime64[ns](2), float64(8), object(10)
memory usage: 8.5+ MB

In [29]:
df3 = df1.describe(include="all")

C:\Users\BhuwanDhakal\AppData\Local\Temp\ipykernel_14944\273037843.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df3 = df1.describe(include="all")
C:\Users\BhuwanDhakal\AppData\Local\Temp\ipykernel_14944\273037843.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df3 = df1.describe(include="all")

In [30]:
df3.to_clipboard()